tiborsimon/embedded-tdd-headers/pic/8bit/pic18f45k50_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18F45K50_H_
#define _PIC18F45K50_H_

#define SRCON1                        0
#define SRRC1E                        1
#define SRRC2E                        2
#define SRRCKE                        3
#define SRRPE                         4
#define SRSC1E                        5
#define SRSC2E                        6
#define SRSCKE                        7
#define SRSPE                         8
#define SRCON0                        9
#define SRPR                          10
#define SRPS                          11
#define SRNQEN                        12
#define SRQEN                         13
#define SRCLK0                        14
#define SRCLK                         15
#define SRCLK1                        16
#define SRCLK2                        17
#define SRLEN                         18
#define CCPTMRS                       19
#define C1TSEL                        20
#define C2TSEL                        21
#define VREGCON                       22
#define VREGPM                        23
#define ANSELA                        24
#define ANSA0                         25
#define ANSA1                         26
#define ANSA2                         27
#define ANSA3                         28
#define ANSA5                         29
#define ANSELB                        30
#define ANSB0                         31
#define ANSB1                         32
#define ANSB2                         33
#define ANSB3                         34
#define ANSB4                         35
#define ANSB5                         36
#define ANSELC                        37
#define ANSC2                         38
#define ANSC6                         39
#define ANSC7                         40
#define ANSELD                        41
#define ANSD0                         42
#define ANSD1                         43
#define ANSD2                         44
#define ANSD3                         45
#define ANSD4                         46
#define ANSD5                         47
#define ANSD6                         48
#define ANSD7                         49
#define ANSELE                        50
#define ANSE0                         51
#define ANSE1                         52
#define ANSE2                         53
#define UCON                          54
#define SUSPND                        55
#define RESUME                        56
#define USBEN                         57
#define PKTDIS                        58
#define SE0                           59
#define PPBRST                        60
#define USTAT                         61
#define PPBI                          62
#define DIR                           63
#define ENDP                          64
#define ENDP0                         65
#define ENDP1                         66
#define ENDP2                         67
#define ENDP3                         68
#define UCFG                          69
#define PPB                           70
#define UPP0                          71
#define PPB0                          72
#define UPP1                          73
#define PPB1                          74
#define FSEN                          75
#define UTRDIS                        76
#define UPUEN                         77
#define UOEMON                        78
#define UTEYE                         79
#define UADDR                         80
#define ADDR                          81
#define ADDR0                         82
#define ADDR1                         83
#define ADDR2                         84
#define ADDR3                         85
#define ADDR4                         86
#define ADDR5                         87
#define ADDR6                         88
#define UIE                           89
#define URSTIE                        90
#define UERRIE                        91
#define ACTVIE                        92
#define TRNIE                         93
#define IDLEIE                        94
#define STALLIE                       95
#define SOFIE                         96
#define UIR                           97
#define URSTIF                        98
#define UERRIF                        99
#define ACTVIF                        100
#define TRNIF                         101
#define IDLEIF                        102
#define STALLIF                       103
#define SOFIF                         104
#define UEIE                          105
#define PIDEE                         106
#define CRC5EE                        107
#define CRC16EE                       108
#define DFN8EE                        109
#define BTOEE                         110
#define BTSEE                         111
#define UEIR                          112
#define PIDEF                         113
#define CRC5EF                        114
#define CRC16EF                       115
#define DFN8EF                        116
#define BTOEF                         117
#define BTSEF                         118
#define UFRML                         119
#define FRML                          120
#define FRM0                          121
#define UFRML_FRM                     122
#define FRM1                          123
#define FRM2                          124
#define FRM3                          125
#define FRM4                          126
#define FRM5                          127
#define FRM6                          128
#define FRM7                          129
#define UFRMH                         130
#define FRM8                          131
#define UFRMH_FRM                     132
#define FRM9                          133
#define FRM10                         134
#define UEP0                          135
#define UEP0_EPSTALL                  136
#define EP0STALL                      137
#define EPSTALL0                      138
#define UEP0_EPINEN                   139
#define EPINEN0                       140
#define EP0INEN                       141
#define UEP0_EPOUTEN                  142
#define EP0OUTEN                      143
#define EPOUTEN0                      144
#define EPCONDIS0                     145
#define EP0CONDIS                     146
#define UEP0_EPCONDIS                 147
#define UEP0_EPHSHK                   148
#define EP0HSHK                       149
#define EPHSHK0                       150
#define UEP1                          151
#define EPSTALL1                      152
#define EP1STALL                      153
#define UEP1_EPSTALL                  154
#define EPINEN1                       155
#define EP1INEN                       156
#define UEP1_EPINEN                   157
#define EPOUTEN1                      158
#define UEP1_EPOUTEN                  159
#define EP1OUTEN                      160
#define UEP1_EPCONDIS                 161
#define EP1CONDIS                     162
#define EPCONDIS1                     163
#define EPHSHK1                       164
#define EP1HSHK                       165
#define UEP1_EPHSHK                   166
#define UEP2                          167
#define EP2STALL                      168
#define EPSTALL2                      169
#define UEP2_EPSTALL                  170
#define EP2INEN                       171
#define EPINEN2                       172
#define UEP2_EPINEN                   173
#define EP2OUTEN                      174
#define UEP2_EPOUTEN                  175
#define EPOUTEN2                      176
#define EP2CONDIS                     177
#define UEP2_EPCONDIS                 178
#define EPCONDIS2                     179
#define EP2HSHK                       180
#define EPHSHK2                       181
#define UEP2_EPHSHK                   182
#define UEP3                          183
#define UEP3_EPSTALL                  184
#define EPSTALL3                      185
#define EP3STALL                      186
#define UEP3_EPINEN                   187
#define EPINEN3                       188
#define EP3INEN                       189
#define EP3OUTEN                      190
#define EPOUTEN3                      191
#define UEP3_EPOUTEN                  192
#define UEP3_EPCONDIS                 193
#define EP3CONDIS                     194
#define EPCONDIS3                     195
#define EPHSHK3                       196
#define UEP3_EPHSHK                   197
#define EP3HSHK                       198
#define UEP4                          199
#define EP4STALL                      200
#define EPSTALL4                      201
#define UEP4_EPSTALL                  202
#define UEP4_EPINEN                   203
#define EP4INEN                       204
#define EPINEN4                       205
#define UEP4_EPOUTEN                  206
#define EPOUTEN4                      207
#define EP4OUTEN                      208
#define EPCONDIS4                     209
#define EP4CONDIS                     210
#define UEP4_EPCONDIS                 211
#define EPHSHK4                       212
#define EP4HSHK                       213
#define UEP4_EPHSHK                   214
#define UEP5                          215
#define EP5STALL                      216
#define UEP5_EPSTALL                  217
#define EPSTALL5                      218
#define EPINEN5                       219
#define UEP5_EPINEN                   220
#define EP5INEN                       221
#define EPOUTEN5                      222
#define UEP5_EPOUTEN                  223
#define EP5OUTEN                      224
#define EPCONDIS5                     225
#define EP5CONDIS                     226
#define UEP5_EPCONDIS                 227
#define UEP5_EPHSHK                   228
#define EPHSHK5                       229
#define EP5HSHK                       230
#define UEP6                          231
#define EPSTALL6                      232
#define UEP6_EPSTALL                  233
#define EP6STALL                      234
#define EP6INEN                       235
#define UEP6_EPINEN                   236
#define EPINEN6                       237
#define EP6OUTEN                      238
#define EPOUTEN6                      239
#define UEP6_EPOUTEN                  240
#define UEP6_EPCONDIS                 241
#define EP6CONDIS                     242
#define EPCONDIS6                     243
#define EPHSHK6                       244
#define UEP6_EPHSHK                   245
#define EP6HSHK                       246
#define UEP7                          247
#define UEP7_EPSTALL                  248
#define EP7STALL                      249
#define EPSTALL7                      250
#define EP7INEN                       251
#define EPINEN7                       252
#define UEP7_EPINEN                   253
#define EP7OUTEN                      254
#define UEP7_EPOUTEN                  255
#define EPOUTEN7                      256
#define UEP7_EPCONDIS                 257
#define EP7CONDIS                     258
#define EPCONDIS7                     259
#define EPHSHK7                       260
#define UEP7_EPHSHK                   261
#define EP7HSHK                       262
#define UEP8                          263
#define EPSTALL8                      264
#define UEP8_EPSTALL                  265
#define UEP8_EPINEN                   266
#define EPINEN8                       267
#define UEP8_EPOUTEN                  268
#define EPOUTEN8                      269
#define UEP8_EPCONDIS                 270
#define EPCONDIS8                     271
#define UEP8_EPHSHK                   272
#define EPHSHK8                       273
#define UEP9                          274
#define EPSTALL9                      275
#define UEP9_EPSTALL                  276
#define EPINEN9                       277
#define UEP9_EPINEN                   278
#define UEP9_EPOUTEN                  279
#define EPOUTEN9                      280
#define UEP9_EPCONDIS                 281
#define EPCONDIS9                     282
#define UEP9_EPHSHK                   283
#define EPHSHK9                       284
#define UEP10                         285
#define EPSTALL10                     286
#define UEP10_EPSTALL                 287
#define EPINEN10                      288
#define UEP10_EPINEN                  289
#define UEP10_EPOUTEN                 290
#define EPOUTEN10                     291
#define EPCONDIS10                    292
#define UEP10_EPCONDIS                293
#define UEP10_EPHSHK                  294
#define EPHSHK10                      295
#define UEP11                         296
#define UEP11_EPSTALL                 297
#define EPSTALL11                     298
#define EPINEN11                      299
#define UEP11_EPINEN                  300
#define UEP11_EPOUTEN                 301
#define EPOUTEN11                     302
#define EPCONDIS11                    303
#define UEP11_EPCONDIS                304
#define UEP11_EPHSHK                  305
#define EPHSHK11                      306
#define UEP12                         307
#define EPSTALL12                     308
#define UEP12_EPSTALL                 309
#define UEP12_EPINEN                  310
#define EPINEN12                      311
#define EPOUTEN12                     312
#define UEP12_EPOUTEN                 313
#define EPCONDIS12                    314
#define UEP12_EPCONDIS                315
#define EPHSHK12                      316
#define UEP12_EPHSHK                  317
#define UEP13                         318
#define UEP13_EPSTALL                 319
#define EPSTALL13                     320
#define EPINEN13                      321
#define UEP13_EPINEN                  322
#define UEP13_EPOUTEN                 323
#define EPOUTEN13                     324
#define EPCONDIS13                    325
#define UEP13_EPCONDIS                326
#define EPHSHK13                      327
#define UEP13_EPHSHK                  328
#define UEP14                         329
#define UEP14_EPSTALL                 330
#define EPSTALL14                     331
#define EPINEN14                      332
#define UEP14_EPINEN                  333
#define UEP14_EPOUTEN                 334
#define EPOUTEN14                     335
#define EPCONDIS14                    336
#define UEP14_EPCONDIS                337
#define UEP14_EPHSHK                  338
#define EPHSHK14                      339
#define UEP15                         340
#define UEP15_EPSTALL                 341
#define EPSTALL15                     342
#define UEP15_EPINEN                  343
#define EPINEN15                      344
#define UEP15_EPOUTEN                 345
#define EPOUTEN15                     346
#define EPCONDIS15                    347
#define UEP15_EPCONDIS                348
#define UEP15_EPHSHK                  349
#define EPHSHK15                      350
#define SLRCON                        351
#define SLRA                          352
#define SLRB                          353
#define SLRC                          354
#define SLRD                          355
#define SLRE                          356
#define VREFCON2                      357
#define DACR0                         358
#define DACR                          359
#define DACR1                         360
#define DACR2                         361
#define DACR3                         362
#define DACR4                         363
#define VREFCON1                      364
#define DACNSS                        365
#define DACPSS                        366
#define DACPSS0                       367
#define DACPSS1                       368
#define DACOE                         369
#define DACLPS                        370
#define DACEN                         371
#define VREFCON0                      372
#define TSRNG                         373
#define TSEN                          374
#define FVRS                          375
#define FVRS0                         376
#define FVRS1                         377
#define FVRST                         378
#define FVREN                         379
#define PMD0                          380
#define TMR1MD                        381
#define SPI1MD                        382
#define TMR2MD                        383
#define SPI2MD                        384
#define TMR3MD                        385
#define ACTMD                         386
#define STMD                          387
#define USBMD                         388
#define UARTMD                        389
#define UART1MD                       390
#define PMD1                          391
#define EMBMD                         392
#define CCP1MD                        393
#define CCP2MD                        394
#define ADCMD                         395
#define CMP1MD                        396
#define CMP2MD                        397
#define CTMUMD                        398
#define MSSPMD                        399
#define SSP1MD                        400
#define MSSP1MD                       401
#define PORTA                         402
#define ULPWUIN                       403
#define AN0                           404
#define PORTA_RA0                     405
#define AN1                           406
#define PORTA_RA1                     407
#define AN2                           408
#define PORTA_RA2                     409
#define VREFM                         410
#define AN3                           411
#define PORTA_RA3                     412
#define VREFP                         413
#define PORTA_RA4                     414
#define T0CKI                         415
#define AN4                           416
#define PORTA_RA5                     417
#define LVDIN                         418
#define HLVDIN                        419
#define PORTA_RA6                     420
#define OSC2                          421
#define PORTA_RA7                     422
#define RJPU                          423
#define PORTB                         424
#define INT0                          425
#define PORTB_RB0                     426
#define INT1                          427
#define PORTB_RB1                     428
#define INT2                          429
#define PORTB_RB2                     430
#define CCP2_PA2                      431
#define PORTB_RB3                     432
#define PORTB_RB4                     433
#define PGM                           434
#define PORTB_RB5                     435
#define PGC                           436
#define PORTB_RB6                     437
#define PGD                           438
#define PORTB_RB7                     439
#define PORTC                         440
#define T13CKI                        441
#define T1OSO                         442
#define PORTC_RC0                     443
#define CCP2                          444
#define T1OSI                         445
#define PA2                           446
#define PORTC_RC1                     447
#define CCP1                          448
#define P1A                           449
#define PA1                           450
#define PORTC_RC2                     451
#define RC4                           452
#define RC5                           453
#define TX                            454
#define CK                            455
#define PORTC_RC6                     456
#define DT                            457
#define RX                            458
#define PORTC_RC7                     459
#define PORTD                         460
#define SPP0                          461
#define PORTD_RD0                     462
#define PORTD_RD1                     463
#define SPP1                          464
#define PORTD_RD2                     465
#define SPP2                          466
#define PORTD_RD3                     467
#define SPP3                          468
#define SPP4                          469
#define PORTD_RD4                     470
#define SPP5                          471
#define PORTD_RD5                     472
#define PORTD_RD6                     473
#define SPP6                          474
#define PORTD_RD7                     475
#define SS2                           476
#define SPP7                          477
#define PORTE                         478
#define CK1SPP                        479
#define PD2                           480
#define RDE                           481
#define PORTE_RE0                     482
#define CK2SPP                        483
#define WRE                           484
#define PC2                           485
#define PORTE_RE1                     486
#define CCP10                         487
#define OESPP                         488
#define PB2                           489
#define CS                            490
#define PORTE_RE2                     491
#define RE3                           492
#define CCP9E                         493
#define PC3E                          494
#define WPUB                          495
#define WPUB0                         496
#define WPUB1                         497
#define WPUB2                         498
#define WPUB3                         499
#define WPUB4                         500
#define WPUB5                         501
#define WPUB6                         502
#define WPUB7                         503
#define IOCB                          504
#define IOCB4                         505
#define IOCB5                         506
#define IOCB6                         507
#define IOCB7                         508
#define IOCC                          509
#define IOCC0                         510
#define IOCC1                         511
#define IOCC2                         512
#define IOCC4                         513
#define IOCC5                         514
#define IOCC6                         515
#define IOCC7                         516
#define CTMUICON                      517
#define IRNG                          518
#define IRNG0                         519
#define IRNG1                         520
#define ITRIM0                        521
