tiborsimon/embedded-tdd-headers/pic/8bit/pic18f45k50_tdd.h
#define ITRIM                         522
#define ITRIM1                        523
#define ITRIM2                        524
#define ITRIM3                        525
#define ITRIM4                        526
#define ITRIM5                        527
#define LATA                          528
#define LATA0                         529
#define LA0                           530
#define LATA1                         531
#define LA1                           532
#define LATA2                         533
#define LA2                           534
#define LATA3                         535
#define LA3                           536
#define LATA4                         537
#define LA4                           538
#define LATA5                         539
#define LA5                           540
#define LATA6                         541
#define LA6                           542
#define LATA7                         543
#define LA7                           544
#define LATB                          545
#define LB0                           546
#define LATB0                         547
#define LB1                           548
#define LATB1                         549
#define LB2                           550
#define LATB2                         551
#define LB3                           552
#define LATB3                         553
#define LB4                           554
#define LATB4                         555
#define LB5                           556
#define LATB5                         557
#define LB6                           558
#define LATB6                         559
#define LB7                           560
#define LATB7                         561
#define LATC                          562
#define LATC0                         563
#define LC0                           564
#define LATC1                         565
#define LC1                           566
#define LATC2                         567
#define LC2                           568
#define LATC4                         569
#define LC4                           570
#define LATC5                         571
#define LC5                           572
#define LC6                           573
#define LATC6                         574
#define LATC7                         575
#define LC7                           576
#define LATD                          577
#define LATD0                         578
#define LD0                           579
#define LATD1                         580
#define LD1                           581
#define LATD2                         582
#define LD2                           583
#define LATD3                         584
#define LD3                           585
#define LATD4                         586
#define LD4                           587
#define LATD5                         588
#define LD5                           589
#define LATD6                         590
#define LD6                           591
#define LATD7                         592
#define LD7                           593
#define LATE                          594
#define LATE0                         595
#define LE0                           596
#define LATE1                         597
#define LE1                           598
#define LATE2                         599
#define LE2                           600
#define CTMUCONL                      601
#define EDG1STAT                      602
#define EDG2STAT                      603
#define EDG1SEL                       604
#define EDG1SEL0                      605
#define EDG1SEL1                      606
#define EDG1POL                       607
#define EDG2SEL0                      608
#define EDG2SEL                       609
#define EDG2SEL1                      610
#define EDG2POL                       611
#define CTMUCONH                      612
#define TRIGEN                        613
#define CTTRIG                        614
#define IDISSEN                       615
#define EDGSEQEN                      616
#define EDGEN                         617
#define TGEN                          618
#define SIDL                          619
#define CTMUSIDL                      620
#define ON                            621
#define CTMUEN                        622
#define CCPR2L                        623
#define CCPR2H                        624
#define TRISA                         625
#define TRISA0                        626
#define TRISA_RA0                     627
#define TRISA1                        628
#define TRISA_RA1                     629
#define TRISA2                        630
#define TRISA_RA2                     631
#define TRISA3                        632
#define TRISA_RA3                     633
#define TRISA_RA4                     634
#define TRISA4                        635
#define TRISA_RA5                     636
#define TRISA5                        637
#define TRISA_RA6                     638
#define TRISA6                        639
#define TRISA_RA7                     640
#define TRISA7                        641
#define TRISB                         642
#define TRISB_RB0                     643
#define TRISB0                        644
#define TRISB_RB1                     645
#define TRISB1                        646
#define TRISB_RB2                     647
#define TRISB2                        648
#define TRISB_RB3                     649
#define TRISB3                        650
#define TRISB_RB4                     651
#define TRISB4                        652
#define TRISB_RB5                     653
#define TRISB5                        654
#define TRISB_RB6                     655
#define TRISB6                        656
#define TRISB_RB7                     657
#define TRISB7                        658
#define TRISC                         659
#define TRISC0                        660
#define TRISC_RC0                     661
#define TRISC1                        662
#define TRISC_RC1                     663
#define TRISC2                        664
#define TRISC_RC2                     665
#define TRISC4                        666
#define TRISC5                        667
#define TRISC6                        668
#define TRISC_RC6                     669
#define TRISC7                        670
#define TRISC_RC7                     671
#define TRISD                         672
#define TRISD_RD0                     673
#define TRISD0                        674
#define TRISD_RD1                     675
#define TRISD1                        676
#define TRISD_RD2                     677
#define TRISD2                        678
#define TRISD_RD3                     679
#define TRISD3                        680
#define TRISD_RD4                     681
#define TRISD4                        682
#define TRISD_RD5                     683
#define TRISD5                        684
#define TRISD_RD6                     685
#define TRISD6                        686
#define TRISD_RD7                     687
#define TRISD7                        688
#define TRISE                         689
#define TRISE_RE0                     690
#define TRISE0                        691
#define TRISE_RE1                     692
#define TRISE1                        693
#define TRISE_RE2                     694
#define TRISE2                        695
#define WPUE3                         696
#define CCP2CON                       697
#define CCP2M                         698
#define CCP2M0                        699
#define CCP2M1                        700
#define CCP2M2                        701
#define CCP2M3                        702
#define DC2B0                         703
#define CCP2Y                         704
#define DC2B                          705
#define DC2B1                         706
#define CCP2X                         707
#define CM1CON0                       708
#define C1CH                          709
#define C1CH0                         710
#define CM1CON0_CCH0                  711
#define CM1CON0_CCH                   712
#define CM1CON0_CCH1                  713
#define C1CH1                         714
#define CM1CON0_CREF                  715
#define C1R                           716
#define C1SP                          717
#define CM1CON0_CPOL                  718
#define C1POL                         719
#define CM1CON0_COE                   720
#define C1OE                          721
#define C1OUT                         722
#define COUT1                         723
#define CM1CON0_CON                   724
#define C1ON                          725
#define CM2CON0                       726
#define CM2CON0_CCH0                  727
#define C2CH0                         728
#define C2CH                          729
#define CM2CON0_CCH                   730
#define CM2CON0_CCH1                  731
#define C2CH1                         732
#define C2R                           733
#define CM2CON0_CREF                  734
#define C2SP                          735
#define C2POL                         736
#define CM2CON0_CPOL                  737
#define CM2CON0_COE                   738
#define C2OE                          739
#define C2OUT                         740
#define COUT2                         741
#define CM2CON0_CON                   742
#define C2ON                          743
#define CM2CON1                       744
#define C2SYNC                        745
#define C1SYNC                        746
#define C2HYS                         747
#define C1HYS                         748
#define C2RSEL                        749
#define C1RSEL                        750
#define MC2OUT                        751
#define MC1OUT                        752
#define OSCTUNE                       753
#define TUN0                          754
#define TUN                           755
#define TUN1                          756
#define TUN2                          757
#define TUN3                          758
#define TUN4                          759
#define TUN5                          760
#define TUN6                          761
#define SPLLMULT                      762
#define HLVDCON                       763
#define HLVDL                         764
#define HLVDL0                        765
#define HLVDL1                        766
#define HLVDL2                        767
#define HLVDL3                        768
#define HLVDEN                        769
#define IRVST                         770
#define BGVST                         771
#define VDIRMAG                       772
#define PIE1                          773
#define TMR1IE                        774
#define TMR2IE                        775
#define CCP1IE                        776
#define SSPIE                         777
#define SSP1IE                        778
#define TXIE                          779
#define TX1IE                         780
#define RCIE                          781
#define RC1IE                         782
#define ADIE                          783
#define STIE                          784
#define PSPIE                         785
#define ACTIE                         786
#define PIR1                          787
#define TMR1IF                        788
#define TMR2IF                        789
#define CCP1IF                        790
#define SSPIF                         791
#define SSP1IF                        792
#define TXIF                          793
#define TX1IF                         794
#define RCIF                          795
#define RC1IF                         796
#define ADIF                          797
#define PSPIF                         798
#define STIF                          799
#define ACTIF                         800
#define IPR1                          801
#define TMR1IP                        802
#define TMR2IP                        803
#define CCP1IP                        804
#define SSP1IP                        805
#define SSPIP                         806
#define TX1IP                         807
#define TXIP                          808
#define RC1IP                         809
#define RCIP                          810
#define ADIP                          811
#define ACTIP                         812
#define PSPIP                         813
#define STIP                          814
#define PIE2                          815
#define CCP2IE                        816
#define TMR3IE                        817
#define HLVDIE                        818
#define LVDIE                         819
#define BCLIE                         820
#define BCL1IE                        821
#define EEIE                          822
#define C2IE                          823
#define CM2IE                         824
#define C1IE                          825
#define CMIE                          826
#define CM1IE                         827
#define OSCFIE                        828
#define PIR2                          829
#define CCP2IF                        830
#define TMR3IF                        831
#define HLVDIF                        832
#define LVDIF                         833
#define BCLIF                         834
#define BCL1IF                        835
#define EEIF                          836
#define C2IF                          837
#define CM2IF                         838
#define C1IF                          839
#define CMIF                          840
#define CM1IF                         841
#define OSCFIF                        842
#define IPR2                          843
#define CCP2IP                        844
#define TMR3IP                        845
#define HLVDIP                        846
#define LVDIP                         847
#define BCL1IP                        848
#define BCLIP                         849
#define EEIP                          850
#define CM2IP                         851
#define C2IP                          852
#define CM1IP                         853
#define C1IP                          854
#define CMIP                          855
#define OSCFIP                        856
#define PIE3                          857
#define TMR1GIE                       858
#define RXB0IE                        859
#define RXBNIE                        860
#define TMR3GIE                       861
#define RXB1IE                        862
#define USBIE                         863
#define TXB0IE                        864
#define TXB1IE                        865
#define CTMUIE                        866
#define PIR3                          867
#define TMR1GIF                       868
#define RXBNIF                        869
#define TMR3GIF                       870
#define USBIF                         871
#define CTMUIF                        872
#define IPR3                          873
#define TMR1GIP                       874
#define TMR3GIP                       875
#define RXBNIP                        876
#define USBIP                         877
#define CTMUIP                        878
#define EECON1                        879
#define RD                            880
#define WR                            881
#define WREN                          882
#define WRERR                         883
#define FREE                          884
#define CFGS                          885
#define EEFS                          886
#define EEPGD                         887
#define EECON2                        888
#define RCSTA1                        889
#define RCD8                          890
#define RX9D                          891
#define OERR                          892
#define FERR                          893
#define ADDEN                         894
#define ADEN                          895
#define CREN                          896
#define SREN                          897
#define SRENA                         898
#define RC8_9                         899
#define RC9                           900
#define RX9                           901
#define SPEN                          902
#define TXSTA1                        903
#define TXD8                          904
#define TX9D1                         905
#define TX9D                          906
#define TRMT                          907
#define TRMT1                         908
#define BRGH1                         909
#define BRGH                          910
#define SENDB1                        911
#define SENDB                         912
#define SYNC                          913
#define SYNC1                         914
#define TXEN1                         915
#define TXEN                          916
#define TX91                          917
#define TX8_9                         918
#define TX9                           919
#define CSRC1                         920
#define CSRC                          921
#define TXREG1                        922
#define RCREG1                        923
#define BRG0                          924
#define SPBRG1                        925
#define BRG1                          926
#define BRG2                          927
#define BRG3                          928
#define BRG4                          929
#define BRG5                          930
#define BRG6                          931
#define BRG7                          932
#define BRG8                          933
#define SPBRGH1                       934
#define BRG9                          935
#define BRG10                         936
#define BRG11                         937
#define BRG12                         938
#define BRG13                         939
#define BRG14                         940
#define BRG15                         941
#define T3CON                         942
#define TMR3ON                        943
#define T3CON_RD16                    944
#define T3RD16                        945
#define nT3SYNC                       946
#define NOT_T3SYNC                    947
#define T3SYNC                        948
#define SOSCEN3                       949
#define T3SOSCEN                      950
#define T3OSCEN                       951
#define T3CON_SOSCEN                  952
#define T3CKPS0                       953
#define T3CKPS                        954
#define T3CKPS1                       955
#define TMR3CS0                       956
#define TMR3CS                        957
#define TMR3CS1                       958
#define RD163                         959
#define TMR3L                         960
#define TMR3H                         961
#define T3GCON                        962
#define T3GSS0                        963
#define T3GSS                         964
#define T3GSS1                        965
#define T3GVAL                        966
#define T3GGO_NOT_DONE                967
#define T3GGO                         968
#define T3GGO_nDONE                   969
#define T3DONE                        970
#define NOT_T3DONE                    971
#define nT3DONE                       972
#define T3GGO_nT3DONE                 973
#define T3GGO_NOT_T3DONE              974
#define T3GSPM                        975
#define T3GTM                         976
#define T3GPOL                        977
#define TMR3GE                        978
#define ACTCON                        979
#define STOR                          980
#define ACTORS                        981
#define ACTOR                         982
#define STLOCK                        983
#define ACTLOCK                       984
#define STSRC                         985
#define ACTSRC                        986
#define STUD                          987
#define ACTUD                         988
#define ACTD                          989
#define ACTEN                         990
#define STEN                          991
#define ACTSEL                        992
#define P1SSBD                        993
#define PSSBD0                        994
#define PSS1BD0                       995
#define PSS1BD                        996
#define PSSBD1                        997
#define PSS1BD1                       998
#define PSSAC0                        999
#define P1SSAC                        1000
#define PSS1AC                        1001
#define PSS1AC0                       1002
#define PSSAC1                        1003
#define PSS1AC1                       1004
#define ECCP1AS                       1005
#define CCP1AS                        1006
#define ECCP1AS0                      1007
#define ECCP1AS1                      1008
#define ECCP1AS2                      1009
#define CCP1ASE                       1010
#define ECCP1ASE                      1011
#define PWM1CON                       1012
#define PDC0                          1013
#define P1DC                          1014
#define PDC1                          1015
#define PDC2                          1016
#define PDC3                          1017
#define PDC4                          1018
#define PDC5                          1019
#define PDC6                          1020
#define P1RSEN                        1021
#define PR1SEN                        1022
#define BAUDCON1                      1023
#define ABDEN1                        1024
#define ABDEN                         1025
#define WUE1                          1026
#define W4E                           1027
#define WUE                           1028
#define BRG161                        1029
#define BRG16                         1030
#define CKTXP                         1031
#define SCKP1                         1032
#define TXCKP                         1033
#define TXCKP1                        1034
#define SCKP                          1035
#define DTRXP1                        1036
#define RXDTP1                        1037
#define DTRXP                         1038
#define RXCKP                         1039
#define RXDTP                         1040
#define RCMT1                         1041
#define RCIDL1                        1042
#define RCIDL                         1043
#define RCMT                          1044
#define ABDOVF                        1045
#define ABDOVF1                       1046
#define PSTR1CON                      1047
#define STR1A                         1048
#define STRA                          1049
#define STR1B                         1050
#define STRB                          1051
#define STR1C                         1052
#define STRC                          1053
#define STR1D                         1054
#define STRD                          1055
#define STR1SYNC                      1056
#define STRSYNC                       1057
#define T2CON                         1058
#define T2CKPS0                       1059
#define T2CKPS                        1060
#define T2CKPS1                       1061
#define TMR2ON                        1062
#define T2OUTPS0                      1063
#define T2OUTPS                       1064
#define T2OUTPS1                      1065
#define T2OUTPS2                      1066
#define T2OUTPS3                      1067
#define PR2                           1068
#define TMR2                          1069
#define CCP1CON                       1070
#define CCP1M0                        1071
#define CCP1M                         1072
#define CCP1M1                        1073
#define CCP1M2                        1074
#define CCP1M3                        1075
#define CCP1Y                         1076
#define DC1B                          1077
#define DC1B0                         1078
#define CCP1X                         1079
#define DC1B1                         1080
#define P1M                           1081
#define P1M0                          1082
#define P1M1                          1083
#define CCPR1L                        1084
#define CCPR1H                        1085
#define ADCON2                        1086
#define ADCS0                         1087
#define ADCS                          1088
#define ADCS1                         1089
#define ADCS2                         1090
