tiborsimon/embedded-tdd-headers/pic/8bit/pic18f45k50_tdd.h
#define ACQT0                         1091
#define ACQT                          1092
#define ACQT1                         1093
#define ACQT2                         1094
#define ADFM                          1095
#define ADCON1                        1096
#define NVCFG                         1097
#define NVCFG0                        1098
#define NVCFG1                        1099
#define PVCFG                         1100
#define PVCFG0                        1101
#define CHSN3                         1102
#define PVCFG1                        1103
#define TRIGSEL                       1104
#define ADCON0                        1105
#define ADON                          1106
#define nDONE                         1107
#define GODONE                        1108
#define GO_nDONE                      1109
#define NOT_DONE                      1110
#define GO_DONE                       1111
#define DONE                          1112
#define GO                            1113
#define GO_NOT_DONE                   1114
#define CHS                           1115
#define SSP1CON2                      1116
#define SEN1                          1117
#define SEN                           1118
#define ADMSK11                       1119
#define RSEN1                         1120
#define RSEN                          1121
#define ADMSK1                        1122
#define PEN                           1123
#define ADMSK21                       1124
#define PEN1                          1125
#define ADMSK2                        1126
#define ADMSK31                       1127
#define RCEN                          1128
#define RCEN1                         1129
#define ADMSK3                        1130
#define ACKEN                         1131
#define ACKEN1                        1132
#define ADMSK41                       1133
#define ADMSK4                        1134
#define ACKDT1                        1135
#define ADMSK51                       1136
#define ADMSK5                        1137
#define ACKDT                         1138
#define ACKSTAT                       1139
#define ACKSTAT1                      1140
#define GCEN                          1141
#define GCEN1                         1142
#define SSP1CON1                      1143
#define SSPM0                         1144
#define SSPM                          1145
#define SSPM01                        1146
#define SSPM1                         1147
#define SSPM11                        1148
#define SSPM2                         1149
#define SSPM21                        1150
#define SSPM31                        1151
#define SSPM3                         1152
#define CKP                           1153
#define CKP1                          1154
#define SSPEN                         1155
#define SSPEN1                        1156
#define SSPOV1                        1157
#define SSPOV                         1158
#define WCOL1                         1159
#define WCOL                          1160
#define SSP1STAT                      1161
#define BF                            1162
#define BF1                           1163
#define UA1                           1164
#define UA                            1165
#define R_NOT_W                       1166
#define READ_WRITE                    1167
#define RW1                           1168
#define NOT_W                         1169
#define R_W                           1170
#define RW                            1171
#define R                             1172
#define nWRITE                        1173
#define nW                            1174
#define R_nW                          1175
#define I2C_READ                      1176
#define START                         1177
#define START1                        1178
#define S                             1179
#define I2C_START                     1180
#define STOP                          1181
#define I2C_STOP                      1182
#define STOP1                         1183
#define P                             1184
#define NOT_A                         1185
#define DATA_ADDRESS                  1186
#define nA                            1187
#define D_A                           1188
#define D_nA                          1189
#define D                             1190
#define DA1                           1191
#define DA                            1192
#define D_NOT_A                       1193
#define nADDRESS                      1194
#define I2C_DAT                       1195
#define CKE                           1196
#define CKE1                          1197
#define SMP                           1198
#define SMP1                          1199
#define MSK0                          1200
#define SSP1ADD0                      1201
#define MSK01                         1202
#define SSP1ADD                       1203
#define MSK11                         1204
#define MSK1                          1205
#define SSP1ADD1                      1206
#define MSK2                          1207
#define MSK21                         1208
#define SSP1ADD2                      1209
#define MSK31                         1210
#define MSK3                          1211
#define SSP1ADD3                      1212
#define MSK4                          1213
#define MSK41                         1214
#define SSP1ADD4                      1215
#define MSK51                         1216
#define MSK5                          1217
#define SSP1ADD5                      1218
#define MSK6                          1219
#define SSP1ADD6                      1220
#define MSK61                         1221
#define MSK71                         1222
#define MSK7                          1223
#define SSP1ADD7                      1224
#define SSP1BUF                       1225
#define SSP1MSK0                      1226
#define SSP1MSK                       1227
#define SSP1MSK1                      1228
#define SSP1MSK2                      1229
#define SSP1MSK3                      1230
#define SSP1MSK4                      1231
#define SSP1MSK5                      1232
#define SSP1MSK6                      1233
#define SSP1MSK7                      1234
#define SSP1CON3                      1235
#define DHEN                          1236
#define AHEN                          1237
#define SBCDE                         1238
#define SDAHT                         1239
#define BOEN                          1240
#define SCIE                          1241
#define PCIE                          1242
#define ACKTIM                        1243
#define T1GCON                        1244
#define T1GSS0                        1245
#define T1GSS                         1246
#define T1GSS1                        1247
#define T1GVAL                        1248
#define T1GGO_nT1DONE                 1249
#define T1GGO_NOT_DONE                1250
#define T1GGO_nDONE                   1251
#define T1DONE                        1252
#define nT1DONE                       1253
#define T1GGO_NOT_T1DONE              1254
#define NOT_T1DONE                    1255
#define T1GGO                         1256
#define T1GSPM                        1257
#define T1GTM                         1258
#define T1GPOL                        1259
#define TMR1GE                        1260
#define T1CON                         1261
#define TMR1ON                        1262
#define T1CON_RD16                    1263
#define T1RD16                        1264
#define NOT_T1SYNC                    1265
#define T1SYNC                        1266
#define nT1SYNC                       1267
#define T1SOSCEN                      1268
#define T1CON_SOSCEN                  1269
#define T1OSCEN                       1270
#define T1CKPS0                       1271
#define T1CKPS                        1272
#define T1CKPS1                       1273
#define TMR1CS0                       1274
#define TMR1CS                        1275
#define TMR1CS1                       1276
#define TMR1L                         1277
#define TMR1H                         1278
#define RCON                          1279
#define BOR                           1280
#define NOT_BOR                       1281
#define nBOR                          1282
#define POR                           1283
#define nPOR                          1284
#define NOT_POR                       1285
#define PD                            1286
#define nPD                           1287
#define NOT_PD                        1288
#define NOT_TO                        1289
#define nTO                           1290
#define TO                            1291
#define nRI                           1292
#define NOT_RI                        1293
#define RI                            1294
#define SBOREN                        1295
#define IPEN                          1296
#define WDTCON                        1297
#define SWDTE                         1298
#define SWDTEN                        1299
#define OSCCON2                       1300
#define LFIOFS                        1301
#define HFIOFR                        1302
#define PRISD                         1303
#define SOSCGO                        1304
#define PLLEN                         1305
#define INTSRC                        1306
#define SOSCRUN                       1307
#define PLLRDY                        1308
#define OSCCON                        1309
#define SCS0                          1310
#define SCS                           1311
#define SCS1                          1312
#define FLTS                          1313
#define HFIOFS                        1314
#define OSTS                          1315
#define IRCF                          1316
#define IRCF0                         1317
#define IRCF1                         1318
#define IRCF2                         1319
#define IDLEN                         1320
#define T0CON                         1321
#define T0PS                          1322
#define T0PS0                         1323
#define T0PS1                         1324
#define T0PS2                         1325
#define PSA                           1326
#define T0SE                          1327
#define T0CS                          1328
#define T08BIT                        1329
#define TMR0ON                        1330
#define TMR0L                         1331
#define TMR0H                         1332
#define STATUS                        1333
#define C                             1334
#define CARRY                         1335
#define DC                            1336
#define ZERO                          1337
#define Z                             1338
#define OV                            1339
#define OVERFLOW                      1340
#define N                             1341
#define NEGATIVE                      1342
#define FSR2L                         1343
#define PLUSW2                        1344
#define PREINC2                       1345
#define POSTDEC2                      1346
#define POSTINC2                      1347
#define INDF2                         1348
#define FSR1L                         1349
#define PLUSW1                        1350
#define PREINC1                       1351
#define POSTDEC1                      1352
#define POSTINC1                      1353
#define INDF1                         1354
#define WREG                          1355
#define FSR0L                         1356
#define PLUSW0                        1357
#define PREINC0                       1358
#define POSTDEC0                      1359
#define POSTINC0                      1360
#define INDF0                         1361
#define INTCON3                       1362
#define INT1IF                        1363
#define INT1F                         1364
#define INT2IF                        1365
#define INT2F                         1366
#define INT1E                         1367
#define INT1IE                        1368
#define INT2IE                        1369
#define INT2E                         1370
#define INT1P                         1371
#define INT1IP                        1372
#define INT2IP                        1373
#define INT2P                         1374
#define INTCON2                       1375
#define IOCIP                         1376
#define TMR0IP                        1377
#define T0IP                          1378
#define INTEDG2                       1379
#define INTEDG1                       1380
#define INTEDG0                       1381
#define RBPU                          1382
#define NOT_RBPU                      1383
#define nRBPU                         1384
#define INTCON                        1385
#define IOCIF                         1386
#define INT0F                         1387
#define INT0IF                        1388
#define T0IF                          1389
#define TMR0IF                        1390
#define IOCIE                         1391
#define INT0E                         1392
#define INT0IE                        1393
#define T0IE                          1394
#define TMR0IE                        1395
#define PEIE                          1396
#define PEIE_GIEL                     1397
#define GIEL                          1398
#define GIEH                          1399
#define GIE_GIEH                      1400
#define GIE                           1401
#define PRODL                         1402
#define PRODH                         1403
#define TABLAT                        1404
#define TBLPTRL                       1405
#define TBLPTRH                       1406
#define PCL                           1407
#define PCLATH                        1408
#define PCH                           1409
#define SP0                           1410
#define STKPTR                        1411
#define SP1                           1412
#define SP2                           1413
#define SP3                           1414
#define SP4                           1415
#define STKUNF                        1416
#define STKOVF                        1417
#define STKFUL                        1418
#define TOSL                          1419
#define TOSH                          1420

#endif // _PIC18F45K50_H_
